Revit 2015 API
CurtainGridLine.Move Method
It is used to move unlocked type-driven grid lines or user defined grid lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Syntax
C#
[ObsoleteAttribute("This method is obsolete in Revit 2015.  Use ElementTransformUtils.MoveElement() to move this gridline within the surface of the curtain grid.")]
public bool Move(
	XYZ moveVec
)
Visual Basic
<ObsoleteAttribute("This method is obsolete in Revit 2015.  Use ElementTransformUtils.MoveElement() to move this gridline within the surface of the curtain grid.")> _
Public Function Move ( _
	moveVec As XYZ _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is obsolete in Revit 2015.  Use ElementTransformUtils.MoveElement() to move this gridline within the surface of the curtain grid.")]
public:
bool Move(
	XYZ^ moveVec
)
Parameters
moveVec
Type: Autodesk.Revit.DB.XYZ
 The vector by which the element is to be moved.
Return Value
If the element is moved successfully then the method return true, otherwise false.
Remarks
Grid line can only move within its surface and U line can only be moved along V direction. So the move distance on grid surface will be calculated from moveVec.
See Also
CurtainGridLine Class
Autodesk.Revit.DB Namespace